{"characters/lucian":{"slug":"characters/lucian","filePath":"characters/lucian.md","title":"Lucian, the Pale Inquisitor","links":["npcs/father-davor","npcs/lady-isovold","custom-backgrounds/luthcheq-witch-hunter","Torm","lore/the-blood-of-the-creator"],"tags":["character","ranger","westgate","dhampir"],"content":"\nSummary\nIn the ash-choked streets of Luthcheq, Lucian was a tool of the Karanoks. As a Witch Hunter under the reign of Shala Karanok, he was trained to smell the “taint” of arcane magic before a single component was touched. He was a cold enforcer of Entropy, believing that his purpose was to keep the world silent and still. That changed in Mordulkin.\nWhile assisting a contingent of the Order of the Gauntlet against a Cult of the Dragon cell, Lucian saw Harkas Vane, a Cleric of Torm, fight with a radiant, selfless conviction that made the Karanoks’ cruelty look like petty bullying. When the battle ended, and the gold of the cult lay scattered, Lucian realized he didn’t want the coins; he wanted the purpose. He left Chessanta that night, trading his dark leathers for the tabard of the Gauntlet.\nLucian rose to the rank of Whitehawk within the Order. Because of his background as a Witch Hunter, he was sent to the den of iniquity: Westgate, a city controlled by merchant houses and criminal syndicates. The Order of the Gauntlet maintains a secret presence there to combat the Night Masks. Lucian was their spearhead, tasked with identifying the vampires hidden within the city’s high society.\nHis fall at the hands of Lady Isovold was not just a physical transformation, but a psychological assault. Because Lucian is a Dhampir and not a full thrall, Isovold’s telepathic link is fractured. He doesn’t hear her voice clearly; instead, he suffers “The Static” — sudden, unwanted visions of her memories, the metallic scent of blood when he is hungry, or a cold, mocking laughter that echoes in his mind when he stands in a temple.\nNow, Lucian lives a ghost-life. His only confidante is Father Davor, a priest of Ilmater in a crumbling Westgate chapel. Davor sees the “half-life” Lucian leads as a form of sacred endurance. He provides Lucian with a sanctuary to meditate and fight off the hunger, reminding him that while his blood is cursed, his soul still answers to Assuran (the Chessantan name for Hoar). Lucian no longer seeks “Justice”, that is for the living. He seeks Retribution.\n\n\n                  \n                   DM Dossier: The Open Wounds\n                  \n                \n\nCurrent Goal: Retribution. Justice is for the living; Lucian seeks specific vengeance against Lady Isovold and the Night Masks.\nKey NPC: Father Davor (Ilmater Priest). Lucian’s only safe harbor in Westgate. Provides spiritual grounding.\nThe Mechanic: “The Static”\nLucian is not a thrall, but the link to Lady Isovold is not broken.\n\nTrigger: When hungry or near great evil/blood.\nEffect: He hears cold laughter or sees her memories. Use this to whisper secrets or taunts during the game.\n\n\n\nHistory\nLuthcheq Witch Hunter\nIn the City of Madness, silence is the only approved prayer. Under the gaze of the Karanok family—the Entropist lords who worship the sphere of annihilation. Here, the “Weave” was taught not as a gift of the gods, but as a parasitic infection of reality.\nHis training was devoid of warmth. He was subjected to the “Rite of Silence,” where initiates were blindfolded for weeks at a time, forced to identify the presence of arcane casters solely by the scent of ozone, the metallic taste of transmutation in the air, or the subtle drop in temperature that accompanies necromancy. He learned to memorize the somatic twitches of a wizard’s fingers before a spell was cast and how to shatter a focus crystal with a single, precise strike. He was not trained to be a warrior; he was trained to be a mage-slayer, a grounding rod for the supernatural lightning of his enemies.\nRecruitment by the Order of the Gauntlet: The Mordulkin Incident\nThe transition from a hound of Luthcheq to a sword of the Gauntlet did not happen in a temple, but in the mud of a Mordulkin cattle yard.\nLucian had been contracted by a minor noble to track a “rogue element”—a supposed sorcerer stirring up peasant unrest. He tracked the target to a barn, only to find it was a trap laid by a cell of the Cult of the Dragon. He was outnumbered, fighting with the desperate, jagged rhythm of a man expecting to die, when the doors were kicked in.\nA contingent of the Order of the Gauntlet, led by Harkas Vane, a Cleric of Torm, stormed the fray. Lucian paused, expecting the “holy knights” to be pompous hindrances. Instead, he watched Vane step between a Cultist’s dragon-breath spell and a cowering farmhand, taking the fire onto his shield with a shout of defiance.\nIn Luthcheq, the weak were culled to protect the strong. To see a warrior of such power bleed for a “nobody” shattered Lucian’s worldview.\nWhen the dust settled, the Cultists lay dead. The farmhands offered the knights their meager coin pouches in gratitude. Vane gently pushed the gold back, his hands burned and blistered, telling them to buy grain for the winter. Lucian, standing in the shadows wiping black blood from his blade, realized the Karanoks had trained him to be a tool of Entropy—to silence the world. The Gauntlet fought to keep it spinning.\nHe approached Vane that night. He didn’t offer a prayer or a confession. He simply dropped his Luthcheq-forged manacles onto the table and said, “My weapon has no direction. Give it one.”\nInquisitor of the Order of the Gauntlet\nAfter leaving Chessenta, Lucian did not immediately find his footing. He drifted to Waterdeep, the City of Splendors, a place that horrified his Luthcheq sensibilities with its open display of wizardry. However, the Order of the Gauntlet recognized that his specific set of skills—tracking the unnatural and resisting magical compulsion—was a resource they desperately lacked.\nWhile the Paladins of Torm and Tyr preached in the sunlight, Lucian worked the shadows of the Dock Ward. He cut his teeth dismantling a cell of the Cult of the Dragon that had infiltrated the frantic trade of the majestic city. He was the “Grey Man” in an order of white cloaks; he was the one who kicked down the doors that the paladins knocked on. It was his brutal efficiency in rooting out doppelgangers in the Waterdeep City Watch that earned him his promotion. The Order realized he was too dangerous to keep as a simple foot soldier, and too effective to discharge. They named him a Whitehawk—an autonomous investigator with the authority to judge the wicked—and pointed him toward the Dragon Coast.\nAs Whitehawk he was deployed to Westgate, a metropolis where the law is merely a suggestion sold to the highest bidder. In a city suffocating under the grip of the Night Masks, he became the Order’s scalpel—precise, sterile, and cold. He was tasked with locating the vampire lords who pulled the strings of the Dragon Coast from the shadows. While the local watch turned a blind eye to the bodies drained in the fog, Lucian stared directly into the abyss, documenting the corruption with the detached scrutiny of a mortician. He did not seek to save the city’s soul; he sought to excise its rot.\nThe Curse\nHis investigation into the Night Masks of Westgate made him a target. Lady Isovold, the syndicate’s master of coin and a vampire of ancient lineage, found his pursuit of her operations insulting. She didn’t want to simply kill a Whitehawk; she wanted to prove that the Order’s “Justice” was a lie. She lured him into a trap—a vaulted archive beneath her estate—along with his unit of four young Chevalls.\nWhile her thralls held him, Isovold forced her blood down his throat. She didn’t turn the Chevalls; she wanted them to be his first meal, a way to ensure he could never return to his old life. She whispered, “When the sun sets, Whitehawk, you will find that hunger is the only law that truly matters,” before sealing the vault.\nAs the transformation took hold, it wasn’t the prayers to Tyr that saved him—it was the cold, iron discipline of the Karanoks. Years spent hunting witches in Luthcheq had taught Lucian to identify the taint of magic and isolate it. He didn’t view the sudden, violent hunger as a temptation; he viewed it as a hostile entity, a foreign mana source to be quarantined. With the clinical detachment of a Witch Hunter, he compartmentalized the agonizing thirst, locking it behind a mental wall of sheer will. While his body screamed for blood, his mind calculated the escape, smashing the drainage gate and forcing his terrified soldiers into the sewers before his resolve could fracture.\nHe woke up changed. He wasn’t the mindless thrall Isovold expected. His Chessantan iron-will had halted the change halfway, leaving him a Dhampir. He made his way to a safehouse of the Order, but as he stood at the gates, he saw his own face on a memorial shroud. He listened from the dark as the survivors spoke of his “noble sacrifice.” He realized then that he couldn’t return; his presence would be a heresy they were sworn to cleanse.\nHalf-life\n\nHe carries a shattered badge of the Order of the Gauntlet in his pocket, a reminder of the man he used to be. Every time he looks in a mirror and sees his white-rooted hair and bloodless skin, his resolve hardens. He is a weapon forged in the dark, and he will not stop until the Night Masks are ash. Lucian now prays to Assuran, the Chessentan name of Hoar, the Doombringer. Tyr’s justice was for the living; Assuran’s retribution was for the dead.\nHe transitioned from a holy investigator to a “contract specialist” in the North. He operates out of the damp alleys of Neverwinter, Waterdeep and Westgate, taking the cases the City Watch ignores. He is a predator of the dark, using the very curse Isovold gave him to climb walls and see through the shadows of the underworld.\nIsovold’s fascination with him is rooted in her own boredom. To her, Lucian is a masterpiece—a hunter who is now part of the herd. She leaves “Calling Cards”, when Lucian tracks a suspect to their lair, he often finds them already slain, their heart removed and replaced with a Chessantan coin or a splinter of his own broken sword. She is grooming him, waiting to see if his hunger eventually eclipses his hate.\nHis motivation is a cold, focused fire. He hunts Isovold for revenge, yes, but also for a glimmer of hope. He has found cryptic mentions in Inquisitorial texts of the The Blood of the creator, the theory that if a Dhampir slays the one who turned them and consumes their essence, the curse might be burned away.\nIn this ghost-life, his only confidante is Father Davor, a priest of Ilmater in a crumbling Westgate chapel. Davor sees the “half-life” Lucian leads as a form of sacred endurance. He provides Lucian with a sanctuary to meditate and fight off the hunger, reminding him that while his blood is cursed, his soul still answers to Assuran (the Chessantan name for Hoar). Lucian no longer seeks “Justice” in the traditional sense.\nHe carries his Heavy Crossbow for the opening shot, a silver-edged Shortsword for the work, and a Dagger for the finish. He doesn’t see himself as a knight anymore. He is a verdict. He is the thing that makes vampires check the shadows behind them. He walks the line between man and monster, the silver badge of the Gauntlet hidden against his pale chest, channeling the magic of the wild into the justice of the dead.\n\n\n                  \n                   Alignment: Neutral Good\n                  \n                \n\nLucian doesn’t kill for fun or hurt civilians. He fulfills contracts, hunting those who truly deserve it. He has no respect for the “Law” because because the law would have him executed.\n\n"},"custom-backgrounds/luthcheq-witch-hunter":{"slug":"custom-backgrounds/luthcheq-witch-hunter","filePath":"custom-backgrounds/luthcheq-witch-hunter.md","title":"Luthcheq Witch Hunter","links":[],"tags":["background","dnd/2024","character-creation"],"content":"\n\n                  \n                  Description \n                  \n                \n\nYou were trained in the mage-hating city of Luthcheq to hunt those who wield the “unnatural” power of the Weave. You are a master of tracking, interrogation, and identifying the subtle signs of supernatural influence.\n\n\nTraits\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTypeProficienciesAttribute PointsIntelligence, Wisdom, DexteritySkillsInvestigation, InsightToolsThieves’ Tools\nEquipment\nChoose one of the following starting equipment options:\n\n(A) A set of traveler’s clothes, thieves’ tools, a weighted manacle, a silvered badge, and a pouch containing 15 gp.\n(B) 50 gp.\n\nFeatures\nOrigin: Alert\nYou gain the following benefits:\n\nInitiative Proficiency: When you roll Initiative, you can add your Proficiency Bonus to the roll.\nInitiative Swap: Immediately after you roll Initiative, you can swap your Initiative with the Initiative of one willing ally in the same combat. You can’t make this swap if you or the ally has the Incapacitated condition.\n\n*Source: Custom (Legal)\n"},"index":{"slug":"index","filePath":"index.md","title":"Welcome to the Chronicles","links":["characters/lucian","characters/kaarg-the-scourged","static/admin/edit"],"tags":[],"content":"Chronicles of Lemuria\nWelcome to the digital archive of our D&amp;D campaigns. Here you will find the legends, lore, and statistics of our heroes.\nCharacters\n\nLucian, the Pale Inquisitor\nKaarg, the Scourged (Coming Soon)\n\nHow to Edit\nThis site is powered by Quartz and Decap CMS.\nTo edit content or add new characters, visit the Admin Panel."},"lore/the-blood-of-the-creator":{"slug":"lore/the-blood-of-the-creator","filePath":"lore/the-blood-of-the-creator.md","title":"The Blood of the creator","links":["npcs/lady-isovold"],"tags":[],"content":"\n\n                  \n                  Quote\n                  \n                \n\n“They say the essence of the master is the only cure for the slave. But in the City of Westgate, who is truly the master?”\n\n\nDiscovery\nLucian found cryptic mentions of this theory in the restricted archives of the Order of the Gauntlet. It posits that a Dhampir can cleanse their blood of the vampiric curse by slaying the one who turned them and consuming their essence in a specific ritual.\nThe Ritual\nThe texts are intentionally vague, likely to discourage such a dark act. However, three components are consistently mentioned:\n\nThe Heart of the Progenitor: Must be taken while the vampire is in a state of true death.\nA Vessel of Pure Silver: Luthcheq-forged silver is recommended for its anti-magical properties.\nA Prayer to Assuran: Justice must be sought as a form of Retribution.\n\nLucian’s Obsession\nFor Lucian, this is more than a legend—it is his only hope of returning to a life where he doesn’t hunger for the living. He hunts Lady Isovold not just for revenge, but for the “cure” he believes she carries in her veins."},"npcs/father-davor":{"slug":"npcs/father-davor","filePath":"npcs/father-davor.md","title":"Father Davor","links":["npcs/lady-isovold"],"tags":["NPC","ally","westgate"],"content":"\n\n\n                  \n                  Quote\n                  \n                \n\n“You carry a heavy burden, my son. Do not ask for it to be lightened. Ask only for shoulders strong enough to bear it.”\n\n\nDescription\nFather Davor is a priest of Ilmater, the Broken God, presiding over a crumbling chapel in the slums of Westgate. He is a weathered, solemn man, his hands roughened by years of tending to the sick and the poor. He believes that suffering is not a punishment, but a test of the soul’s capacity to endure.\nRelationship with Lucian\nDavor is the only person who knows Lucian’s true nature and allows him to live. While the Order of the Gauntlet would execute Lucian as a monster, Davor sees Lucian’s “half-life” as a form of sacred endurance.\nHe provides Lucian with:\n\nSanctuary: A place to rest during the day where the “Static” of Lady Isovold is dampened by holy wards.\nCounsel: He reminds Lucian that while his blood may be cursed, he still has a role to play in this life.\nSupplies: Holy water and information gathered from the downtrodden of the city.\n\nDavor does not offer pity. He offers spiritual steel, helping Lucian build the mental walls necessary to cage the beast within."},"npcs/lady-isovold":{"slug":"npcs/lady-isovold","filePath":"npcs/lady-isovold.md","title":"Lady Isovold","links":["characters/lucian"],"tags":["NPC","villain","vampire","westgate"],"content":"\n\n\n                  \n                  Quote\n                  \n                \n\n“When the sun sets, Whitehawk, you will find that hunger is the only law that truly matters.”\n\n\nDescription\nLady Isovold is the Master of Coin for the Night Masks syndicate and a vampire of ancient lineage. She is a creature of high society, hiding her monstrous nature beneath layers of silk, wealth, and political influence. To her, the city of Westgate is a chessboard, and its citizens are merely pawns—or food.\nShe is not a brute; she is a corruptor. She does not simply wish to kill her enemies; she wishes to dismantle their ideologies.\nRelationship with Lucian\nIsovold is the architect of Lucian, the Pale Inquisitor’s curse. When he investigated her operations as a Whitehawk, she took it as a personal insult. Rather than killing him, she sought to turn the Order’s “justice” into a mockery by forcing her blood upon him.\nShe is fascinated by Lucian’s survival as a Dhampir. To her, he is a “masterpiece”—a hunter who is now part of the herd. She does not view him as a threat, but as a source of entertainment.\nThe Static\nBecause Lucian is not a full thrall, her telepathic hold on him is fractured. She cannot control him directly, but she can bleed into his mind. She appears in his thoughts as “The Static,” offering:\n\nMocking laughter when he enters holy ground.\nFlashes of her own memories when he tastes blood.\nWhispered secrets about his allies to sow paranoia.\n\nTactics: The Calling Cards\nIsovold is grooming Lucian, waiting for his hunger to eclipse his hate. She taunts him by interfering with his contracts. When Lucian tracks a suspect to their lair, he often finds them already slain, their heart removed and replaced with a:\n\nA Chessantan coin.\nA splinter of his own broken sword (which she kept from the vault).\nA note written in elegant script, critiquing his investigative technique.\n"}}